Repository: eslams3dawi/SchoolManagement.API
Catalog: SchoolManagement.Core/Resouces/SharedResources.*.resx
Languages: ar

source: Not Found
ar: غير موجود

# Required
source: This Field Is Required
ar: هذا الحقل مطلوب

# Created
source: Added Successfully
ar: تمت الإضافة بنجاح

# Deleted
source: Deleted Successfully
ar: تم الحذف بنجاح

# Retrieved
source: Data Retrieved Successfully
ar: تم استرجاع البيانات بنجاح

source: Unauthorized
ar: غير مصرح

source: Bad Request
ar: طلب خاطئ

# Unprocessable
source: This Object Is Unprocessable
ar: هذا الكائن لا يمكن معالجته

# Updated
source: Updated Successfully
ar: تم التحديث بنجاح

# NotEmpty
source: Must Not Be Empty
ar: يجب ألا يكون فارغًا

# NotNull
source: Mus Not Be Null
ar: لا يجب أن يكون فارغًا

# ExceededMaxLength
source: Must Not Exceed The Maximum Length
ar: يجب ألا يتجاوز الحد الأقصى للطول

# LessThanMinLength
source: Must Not Less Than The Minimum Length
ar: يجب ألا يقل عن الحد الأدنى للطول

# PhoneExists
source: Already Exists ,Please Enter Another one
ar: موجود بالفعل، يرجى كتابة رقم آخر

source: First Name
ar: الأسم الأول

source: Last Name
ar: الأسم الأخير

source: Address
ar: العنوان

source: Phone
ar: رقم الهاتف

source: Department ID
ar: رقم القسم

# NotValid
source: Is Not Valid
ar: غير صالح

# PasswordsNotMatche
source: Password and Confirm Password do not match
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقتين

# UsernameExists
source: Username Is Already Exists
ar: المستخدم موجود بالفعل

# EmailExists
source: Email Is Already Exists
ar: البريد الإلكتروني موجود بالفعل

source: Deleting Failed
ar: فشل الحذف

source: Updating Failed
ar: فشل التحديث

# AddingFailed
source: Failed Adding User
ar: فشل إضافة المستخدم

source: Change Password Failed
ar: فشل تغيير كلمة المرور

source: UserName
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: UserName Is Not Exists
ar: اسم المستخدم غير موجود

# SignInFailed
source: UserName Or Password Is Wrong
ar: اسم المستخدم أو كلمة المرور خاطئة

source: Invalid Algorithm
ar: خوارزمية غير صالحة

source: Token Is Not Expired
ar: التوكن غير منتهي الصلاحية

source: Invalid Token Claims
ar: مطالبات رمز غير صالحة

source: Refresh Token Is Not Found
ar: لم يتم العثور على رمز التحديث

source: Refresh Token Is Expired
ar: رمز التحديث منتهي الصلاحية

source: Refresh Token Is No Longer Valid
ar: رمز التحديث لم يعد صالحًا

source: Invalid Token
ar: رمز غير صالح

source: Valid Token
ar: رمز صالح

# RoleExists
source: Role Already Exists
ar: الدور موجود بالفعل

source: User Id Not Exists
ar: معرف المستخدم غير موجود

source: Role Not Found
ar: لم يتم العثور على الدور

source: Can Not Delete Used Role
ar: لا يمكن حذف الدور لأنه مستخدم

source: Something Went Wrong While Removing Old User Roles
ar: حدث خطأ ما أثناء إزالة أدوار المستخدم القديمة

source: Something Went Wrong While Adding User Roles
ar: حدث خطأ أثناء إضافة أدوار المستخدم

source: Roles Added Successfully
ar: تمت إضافة الأدوار بنجاح

source: Something Went Wrong In Database While Updating User Roles
ar: حدث خطأ ما في قاعدة البيانات أثناء تحديث أدوار المستخدم

source: Something Went Wrong While Removing Old User Claims
ar: حدث خطأ أثناء إزالة مطالبات المستخدم القديمة

source: Something Went Wrong While Adding User Claims
ar: حدث خطأ أثناء إضافة مطالبات المستخدم

source: Claims Added Successfully
ar: تمت إضافة المطالبات بنجاح

source: Something Went Wrong In Database While Updating User Claims
ar: حدث خطأ في قاعدة البيانات أثناء تحديث مطالبات المستخدم

source: Message
ar: الرسالة

source: Email
ar: البريد الإلكتروني

source: Email Sent Successfully
ar: تم إرسال البريد الإلكتروني بنجاح

source: Failed To Send Email
ar: فشل في إرسال البريد الإلكتروني

source: Please Confirm Email
ar: الرجاء تأكيد البريد الإلكتروني

source: Email Confirmed Successfully
ar: تم تأكيد البريد الإلكتروني بنجاح

source: Failed To Confirm Email
ar: فشل في تأكيد البريد الإلكتروني
